NordicSemiconductor/nrfx/mdk/nrf54l20_enga_flpr.svd
    <peripheral derivedFrom="GLOBAL_PPIB00_NS">
      <name>GLOBAL_PPIB30_NS</name>
      <description>PPIB APB registers 14</description>
      <baseAddress>0x40103000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PPIB00_NS">
      <name>GLOBAL_PPIB30_S</name>
      <description>PPIB APB registers 15</description>
      <baseAddress>0x50103000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM30_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 12</description>
      <baseAddress>0x40104000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS30_NS</name>
      <description>SPI Slave 12</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM30_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 10</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS30_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 10</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE30_NS</name>
      <description>UART with EasyDMA 12</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM30_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 13</description>
      <baseAddress>0x50104000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS30_S</name>
      <description>SPI Slave 13</description>
      <baseAddress>0x50104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM30_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 11</description>
      <baseAddress>0x50104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS30_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 11</description>
      <baseAddress>0x50104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE30_S</name>
      <description>UART with EasyDMA 13</description>
      <baseAddress>0x50104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_COMP_NS</name>
      <description>Comparator 0</description>
      <baseAddress>0x40106000</baseAddress>
      <headerStructName>COMP</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>COMP_LPCOMP</name>
        <value>262</value>
      </interrupt>
      <groupName>COMP</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start comparator</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop comparator</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SAMPLE</name>
          <description>Sample comparator value. This task requires that COMP has been started by the START Task.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_SAMPLE</name>
              <description>Sample comparator value. This task requires that COMP has been started by the START Task.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for task START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task START will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SAMPLE</name>
          <description>Subscribe configuration for task SAMPLE</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SAMPLE will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READY</name>
          <description>COMP is ready and output is valid</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_READY</name>
              <description>COMP is ready and output is valid</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DOWN</name>
          <description>Downward crossing</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_DOWN</name>
              <description>Downward crossing</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_UP</name>
          <description>Upward crossing</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_UP</name>
              <description>Upward crossing</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CROSS</name>
          <description>Downward or upward crossing</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_CROSS</name>
              <description>Downward or upward crossing</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_READY</name>
          <description>Publish configuration for event READY</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event READY will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DOWN</name>
          <description>Publish configuration for event DOWN</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event DOWN will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_UP</name>
          <description>Publish configuration for event UP</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event UP will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CROSS</name>
          <description>Publish configuration for event CROSS</description>
          <addressOffset>0x18C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event CROSS will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
