NordicSemiconductor/nrfx/mdk/nrf54l20_enga_flpr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_OSCILLATORS_NS">
      <name>GLOBAL_OSCILLATORS_S</name>
      <description>Oscillator control 1</description>
      <baseAddress>0x50120000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_REGULATORS_NS">
      <name>GLOBAL_REGULATORS_S</name>
      <description>Voltage regulators 1</description>
      <baseAddress>0x50120000</baseAddress>
      <alternatePeripheral>GLOBAL_OSCILLATORS_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_VREGUSB_NS</name>
      <description>VREGUSB peripheral 0</description>
      <baseAddress>0x40121000</baseAddress>
      <headerStructName>VREGUSB</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VREGUSB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VREGUSB_NS">
      <name>GLOBAL_VREGUSB_S</name>
      <description>VREGUSB peripheral 1</description>
      <baseAddress>0x50121000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
  </peripherals>
</device>